snlkuharlocal/src/Documents/СписаниеТМЦСпути/СписаниеТМЦСпути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТМЦСпути</name>
  <comment>Списание ТМЦ с пути</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВПути</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СписатьСПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоставщика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СторноЗПС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентКомпенсация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКомпенсация</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенКомпенсация</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>СписатьСПоставщика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСКомпенсацией</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаКомпенсации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Компенсация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоСКомпенсацией</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ТоварыВПути/ТоварыВПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВПути</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПоставщика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаEUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.КорректировкаКонтрактаСПроизводителем</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаявкаНаПроизводство</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контракт</name>
    <type>
      <types>CatalogRef.КонтрактыСПроизводителем</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/СписаниеТМЦСпути/ObjectModule.bsl
////////  СОБЫТИЯ ОБЪЕКТА ////////////////////////////////////////////////////////
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения	=Модифицированность();
	
	КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
	МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
	МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);
	
	Если Отказ Тогда Возврат КонецЕсли;		
	
	Если ЕстьИзменения Тогда
		
		СуммаДокумента = ?(Товары.Итог("ВсегоСКомпенсацией") > 0, Товары.Итог("ВсегоСКомпенсацией") * ДокОснование.Курс, Товары.Итог("Всего"));
		
		СуммаПоставщика = ?(Товары.Итог("ВсегоСКомпенсацией") > 0, Товары.Итог("ВсегоСКомпенсацией"), Товары.Итог("СуммаПоставщика"));
		
		ОбъемДокумента = Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
				
		ГруппыТоваров = ГруппыТоваровДокумента(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)	
	Автор				=Неопределено;	
	Дата				=Неопределено;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("Структура") Тогда Возврат КонецЕсли;
	
	Если Основание = Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ВидОснования = Основание.Метаданные().Имя;
		
	ДокОснование	= Основание;
	Дата = ТекущаяДатаСеанса();
	
	Если ЕстьРеквизитДокумента("КонтрагентКомпенсация", Основание.Метаданные()) Тогда
		КонтрагентКомпенсация = Основание.КонтрагентКомпенсация;		
	КонецЕсли;
	
	Если ЕстьРеквизитДокумента("ДоговорКомпенсация", Основание.Метаданные()) Тогда
		ДоговорКомпенсация = Основание.ДоговорКомпенсация;		
	КонецЕсли;
	
	Если ЕстьРеквизитДокумента("ТипЦенКомпенсация", Основание.Метаданные()) Тогда
		ТипЦенКомпенсация = Основание.ТипЦенКомпенсация;		
	КонецЕсли;
	
	// Шворобей ВЮ 13.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1637
	// Шворобей ВЮ 04.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-407
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрактСПроизводителемТовары.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(КонтрактСПроизводителемТовары.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ тзНоменклатураКП
	|ИЗ
	|	Документ.КонтрактСПроизводителем.Товары КАК КонтрактСПроизводителемТовары
	|ГДЕ
	|	КонтрактСПроизводителемТовары.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ЗаказПоставщикуТовары.ЗаявкаПоставщику КАК ЗаявкаПоставщику
	|			ИЗ
	|				Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|			ГДЕ
	|				ЗаказПоставщикуТовары.Ссылка = &ДокОснование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Заказ КАК Заказ,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Количество,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК Всего,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(Остатки.СуммаОстаток, 0) / ВЫБОР
	|					КОГДА ЕСТЬNULL(Остатки.КоличествоОстаток, 1) <> 0
	|						ТОГДА ЕСТЬNULL(Остатки.КоличествоОстаток, 1)
	|					ИНАЧЕ 1
	|				КОНЕЦ КАК ЧИСЛО(10, 2))) <> 0
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Остатки.СуммаОстаток, 0) / ВЫБОР
	|						КОГДА ЕСТЬNULL(Остатки.КоличествоОстаток, 1) <> 0
	|							ТОГДА ЕСТЬNULL(Остатки.КоличествоОстаток, 1)
	|						ИНАЧЕ 1
	|					КОНЕЦ КАК ЧИСЛО(10, 2))
	|		ИНАЧЕ тзНоменклатураКП.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Остатки.СуммаОстаток, 0) / ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.КоличествоОстаток, 1) <> 0
	|				ТОГДА ЕСТЬNULL(Остатки.КоличествоОстаток, 1)
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ЧИСЛО(10, 2)) КАК ЦенаЗПС,
	|	тзНоменклатураКП.Цена КАК ЦенаКП,
	|	ЕСТЬNULL(Остатки.СуммаПоставщикаОстаток, 0) КАК СуммаПоставщика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Товары.Единица, ЗНАЧЕНИЕ(Справочник.Единицы.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Единицы.ПустаяСсылка)
	|			ТОГДА Единицы.Ссылка
	|		ИНАЧЕ Товары.Единица
	|	КОНЕЦ КАК Единица,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Товары.Коэффициент, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(Товары.Коэффициент, 1)
	|	КОНЕЦ КАК Коэффициент,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Остатки.СуммаОстаток, 0) / ВЫБОР
	|			КОГДА ЕСТЬNULL(Остатки.КоличествоОстаток, 1) <> 0
	|				ТОГДА ЕСТЬNULL(Остатки.КоличествоОстаток, 1)
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ЧИСЛО(10, 2)) КАК ЦенаБезСкидки,
	|	ЕСТЬNULL(Товары.ЦенаСКомпенсацией, 0) КАК ЦенаСКомпенсацией,
	|	ЕСТЬNULL(Товары.ЦенаКомпенсации, 0) КАК ЦенаКомпенсации,
	|	ЕСТЬNULL(Товары.Компенсация, 0) * ЕСТЬNULL(Остатки.КоличествоОстаток, 0) / ВЫБОР
	|		КОГДА ЕСТЬNULL(Товары.Количество, 1) <> 0
	|			ТОГДА ЕСТЬNULL(Товары.Количество, 1)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Компенсация,
	|	ЕСТЬNULL(Товары.ВсегоСКомпенсацией, 0) * ЕСТЬNULL(Остатки.КоличествоОстаток, 0) / ВЫБОР
	|		КОГДА ЕСТЬNULL(Товары.Количество, 1) <> 0
	|			ТОГДА ЕСТЬNULL(Товары.Количество, 1)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ВсегоСКомпенсацией,
	|	Товары.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрНакопления.ТоварыВПути.Остатки(&Период, Заказ = &ДокОснование) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК Товары
	|		ПО Остатки.Заказ = Товары.Ссылка
	|			И Остатки.Номенклатура = Товары.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Единицы КАК Единицы
	|		ПО Остатки.Номенклатура = Единицы.Владелец
	// +++ {Кузнецов Сергей Владимирович [01.04.2025] HELP-3786
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ тзНоменклатураКП КАК тзНоменклатураКП
	|		ЛЕВОЕ СОЕДИНЕНИЕ тзНоменклатураКП КАК тзНоменклатураКП
	// }Кузнецов Сергей Владимирович +++ [01.04.2025]
	|		ПО Остатки.Номенклатура = тзНоменклатураКП.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) <> 0";
	// Шворобей ВЮ 04.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-407

	УстановитьПривилегированныйРежим(Истина);
	ТО = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Товары.Очистить();
	Для Каждого СтрокаТО Из ТО Цикл	
		
		СтрокаТЧ = Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТО);
		
		РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
		
		// +++ {Кузнецов Сергей Владимирович [01.04.2025] HELP-3783
		//СтрокаТЧ.СуммаПоставщика = СтрокаТЧ.Всего;
		// }Кузнецов Сергей Владимирович +++ [01.04.2025]		
					
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ЗаполненНаОсновании", Истина);
	// Шворобей ВЮ 13.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1637
	
	Если ВидОснования="ЗаказПоставщику" Тогда
		Контрагент	=Основание.Контрагент;	
		Договор		=Основание.Договор;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	// Шворобей ВЮ 15.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-165
	// Соответственно, для СПП – не давать проводить СПП раньше, чем ПНК.
	#Если Клиент Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписаниеТМЦСпути.Ссылка КАК СПП,
		|	СписаниеТМЦСпути.ДокОснование КАК ЗПС,
		|	СписаниеТМЦСпути.Дата КАК ДатаСПП
		|ПОМЕСТИТЬ ТабСПП
		|ИЗ
		|	Документ.СписаниеТМЦСпути КАК СписаниеТМЦСпути
		|ГДЕ
		|	СписаниеТМЦСпути.ДокОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
		|	И СписаниеТМЦСпути.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабСПП.СПП КАК СПП,
		|	ТабСПП.ЗПС КАК ЗПС,
		|	ЗаказыПоставщикам.Ссылка КАК ПНК,
		|	ТабСПП.ДатаСПП КАК ДатаСПП,
		|	ЗаказыПоставщикам.Ссылка.Дата КАК ДатаПНК,
		|	ВЫБОР
		|		КОГДА ТабСПП.ДатаСПП < ЗаказыПоставщикам.Ссылка.Дата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПризнакДатаРаньше
		|ИЗ
		|	ТабСПП КАК ТабСПП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.ЗаказыПоставщикам КАК ЗаказыПоставщикам
		|		ПО ТабСПП.ЗПС = ЗаказыПоставщикам.ЗПС
		|			И (ЗаказыПоставщикам.Ссылка.Проведен)
		|			И (ТабСПП.ДатаСПП <= ЗаказыПоставщикам.Ссылка.Дата)";
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Выборка.Количество() > 0 Тогда
			Пока Выборка.Следующий() Цикл
				СообщитьИзМодуля("Есть " + Строка(Выборка.ПНК) + " с Датой позже, чем Дата СПП!!!");
			КонецЦикла;
			СообщитьИзМодуля("Либо перенесите дату ПНК, либо перенесите дату СПП");
			Отказ = Истина;
		КонецЕсли;
		
	#КонецЕсли
	// Шворобей ВЮ 15.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-165
	
	Если СторноЗПС Тогда
		ПровестиСторно(Отказ);
		Возврат;
	КонецЕсли;
	
	ДвиженияПоРегистрам = Неопределено;
	
	ТО=РегистрыНакопления.ТоварыВПути.Остатки(,Новый Структура("Заказ",ДокОснование));
		
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаОстатка=ТО.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");	
		
		Если СтрокаОстатка=Неопределено Тогда
			СуммаПоставщика	=0;		
			Сумма			=0;
			Количество		=0;			
		Иначе
			СуммаПоставщика	=СтрокаОстатка.СуммаПоставщика;
			Сумма			=СтрокаОстатка.Сумма;
			Количество		=СтрокаОстатка.Количество;
		КонецЕсли; 
		
		Если Количество=0 Тогда
			Если СтрокаОстатка=Неопределено Тогда
				СтрокаТЧ.Всего				=0;						
				СтрокаТЧ.СуммаПоставщика	=0;						
			Иначе
				Если СтрокаОстатка.Количество=СтрокаТЧ.Количество Тогда
					СтрокаТЧ.Всего				=СтрокаОстатка.Сумма;
					
					СтрокаТЧ.СуммаПоставщика	=СтрокаОстатка.СуммаПоставщика;
				КонецЕсли;			
			КонецЕсли;			
		Иначе
			СтрокаТЧ.Всего				=СтрокаТЧ.Количество*Сумма/Количество;						
				
			СтрокаТЧ.СуммаПоставщика	=СтрокаТЧ.Количество*СуммаПоставщика/Количество;
		КонецЕсли; 
		
		РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект,"ОтВсего");	    
	КонецЦикла;
	
	СуммаПоставщика =Товары.Итог("СуммаПоставщика");
	СуммаДокумента	=Товары.Итог("Всего");
	
	Записать();
	
	ВалютаЗаказа	= ДокОснование.Валюта;
	КурсЗаказа	= ДокОснование.Курс;
	
	ВалютаУпр	= ПараметрыСеанса.ВалютаУпр_2009;
	КурсУпр	= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СтатьяЗатрат");
	ТЗ.Колонки.Добавить("Подразделение");
	ТЗ.Колонки.Добавить("Сумма",ПолучитьОписаниеТиповЧисла(19,2));
	ТЗ.Колонки.Добавить("СуммаПоставщика",ПолучитьОписаниеТиповЧисла(19,2));
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТЗ=ТЗ.Добавить();
		
		СтрокаТЗ.Подразделение	=?(ЗначениеЗаполнено(СтрокаТЧ.Подразделение),СтрокаТЧ.Подразделение,Подразделение);
		СтрокаТЗ.СтатьяЗатрат	=?(ЗначениеЗаполнено(СтрокаТЧ.СтатьяЗатрат),СтрокаТЧ.СтатьяЗатрат,СтатьяЗатрат);
		
		Если СписатьСПоставщика ИЛИ СтрокаТЧ.СписатьСПоставщика Тогда
			СтрокаТЗ.СуммаПоставщика	= СтрокаТЧ.СуммаПоставщика;			
		КонецЕсли;
		
		СтрокаТЗ.Сумма= СтрокаТЧ.Всего-глПересчет(СтрокаТЗ.СуммаПоставщика,ВалютаЗаказа,КурсЗаказа,ВалютаУпр,КурсУпр);					
		
		
		//ТОВАР В ПУТИ
		Если СтрокаТЧ.Количество<>0 ИЛИ СтрокаТЧ.Всего<>0 ИЛИ СтрокаТЧ.СуммаПоставщика<>0 Тогда
			Движение=Движения.ТоварыВПути.Добавить();
			
			Движение.Период				=Дата;
			Движение.ВидДвижения		=ВидДвиженияНакопления.Расход;
			
			Движение.Заказ				=ДокОснование;
			Движение.Номенклатура		=СтрокаТЧ.Номенклатура;
			
			Движение.Количество			=СтрокаТЧ.Количество;
			Движение.Сумма				=СтрокаТЧ.Всего;
			Движение.СуммаПоставщика	=СтрокаТЧ.СуммаПоставщика;			
		КонецЕсли;		
	КонецЦикла; 
	
	ТЗ.Свернуть("Подразделение,СтатьяЗатрат","Сумма,СуммаПоставщика");
	
	//ЗАТРАТЫ
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Если СтрокаТЗ.Сумма<>0 Тогда
			Движение=Движения.Затраты.Добавить();
			
			Движение.Период			= Дата;
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
			
			Движение.Подразделение	= СтрокаТЗ.Подразделение;
			Движение.СтатьяЗатрат	= СтрокаТЗ.СтатьяЗатрат;
			
			Движение.СуммаУпр		= СтрокаТЗ.Сумма;	
			
			Движение.СуммаДокумента	= СтрокаТЗ.Сумма;
			Движение.ВалютаДокумента= ВалютаУпр;	
					//крохин начало
		Движение.Комментарий        = Комментарий;
		//крохин конец

			
			Движение.ДатаЗаписи		=ТекущаяДата();	
		КонецЕсли;
	КонецЦикла;	
	
	//ВЗАИМОРАСЧЕТЫ
	СуммаВзаиморасчетов=ТЗ.Итог("СуммаПоставщика");
	Если СуммаВзаиморасчетов<>0 Тогда
		Движение=Движения.Взаиморасчеты.Добавить();	
		
		Движение.Период		=Дата;
		Движение.ВидДвижения=ВидДвиженияНакопления.Приход;	
		
		Движение.Контрагент	=?(Контрагент.Ведущий.Пустая(),Контрагент,Контрагент.Ведущий);
		Движение.Договор	=ДокОснование.Договор;
			//крохин начало 28.08.2011
        // Движение.СуммаВал	=СуммаВзаиморасчетов;
		Если ДокОснование.Валюта = ПолучитьВалютуРасчетов(Договор) ИЛИ Дата < '20110801' Тогда
		Движение.СуммаВал	=СуммаВзаиморасчетов;
	Иначе
		Движение.СуммаВал = СуммаВзаиморасчетов/КурсЗаказа;
	КонецЕсли;	
	    //крохин конец 28.08.2011
		Движение.СуммаУпр	=глПересчет(СуммаВзаиморасчетов,ВалютаЗаказа,КурсЗаказа,ВалютаУпр,КурсУпр);
		Движение.СуммаДокумента	=СписатьСПоставщика;
		Движение.ВалютаДокумента=ВалютаЗаказа;
	КонецЕсли;
	
	// Шворобей ВЮ 31.10.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1637
	// КОМПЕНСАЦИЯ
	Если ЗначениеЗаполнено(КонтрагентКомпенсация) И ЗначениеЗаполнено(ДоговорКомпенсация) Тогда
		
		//СумКомпВал = Товары.Итог("Компенсация");
		//крохин, сумма только по строкам с галкой "списать с поставщика"
		СумКомпВал = 0;
		Для Каждого СтрокаТЧ Из Товары Цикл
			Если СтрокаТЧ.СписатьСПоставщика Тогда
				СумКомпВал = СумКомпВал + СтрокаТЧ.Компенсация;	
			КонецЕсли;
		КонецЦикла;
		
		СуммаУпр = глПересчет(СумКомпВал, ВалютаЗаказа, КурсЗаказа, ВалютаУпр, КурсУпр);
		
		Если СумКомпВал > 0 Тогда
			ДвижениеПриход = Движения.Взаиморасчеты.Добавить();
			
			ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеПриход.Контрагент = ?(Контрагент.Ведущий.Пустая(), Контрагент, Контрагент.Ведущий);
			ДвижениеПриход.Договор = Договор;
			ДвижениеПриход.Период = Дата;
			ДвижениеПриход.СуммаВал = СумКомпВал;
			ДвижениеПриход.СуммаУпр = СуммаУпр;
			ДвижениеПриход.СуммаДокумента = СуммаДокумента;
			ДвижениеПриход.Регистратор = Ссылка;
			ДвижениеПриход.ВалютаДокумента = ВалютаЗаказа;
			
			ДвижениеРасход = Движения.Взаиморасчеты.Добавить();
			
			ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеРасход.Контрагент = КонтрагентКомпенсация;
			ДвижениеРасход.Договор = ДоговорКомпенсация;
			ДвижениеРасход.Период = Дата;
			ДвижениеРасход.СуммаВал = СумКомпВал;
			ДвижениеРасход.СуммаУпр = СуммаУпр;
			ДвижениеРасход.СуммаДокумента = СуммаДокумента;
			ДвижениеРасход.Регистратор = Ссылка;
			ДвижениеРасход.ВалютаДокумента = ВалютаЗаказа;
			
			Движения.Взаиморасчеты.Записать();
		КонецЕсли;	
	КонецЕсли;
	// Шворобей ВЮ 31.10.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1637
	
КонецПроцедуры

////////// СТОРНО ////////////////////////////////////////////////////////////////

Процедура ПровестиСторно(Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ДокОснование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыПоставщикам.Период КАК Период,
	|	ЗаказыПоставщикам.Регистратор КАК Регистратор,
	|	ЗаказыПоставщикам.ВидДвижения КАК ВидДвижения,
	|	ЗаказыПоставщикам.Склад КАК Склад,
	|	ЗаказыПоставщикам.Заказ КАК Заказ,
	|	ЗаказыПоставщикам.Контракт КАК Контракт,
	|	ЗаказыПоставщикам.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикам.Количество КАК Количество,
	|	ЗаказыПоставщикам.СуммаРуб КАК СуммаРуб,
	|	ЗаказыПоставщикам.СуммаUSD КАК СуммаUSD,
	|	ЗаказыПоставщикам.СуммаEUR КАК СуммаEUR,
	|	ЗаказыПоставщикам.Отправитель КАК Отправитель,
	|	ЗаказыПоставщикам.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗаказыПоставщикам.СуммаДокумента КАК СуммаДокумента,
	|	ВЫРАЗИТЬ(Товары.Цена КАК ЧИСЛО(15, 2)) КАК ЦенаИзДокумента,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ЗаказыПоставщикам.СуммаРуб, 0) / ЕСТЬNULL(ЗаказыПоставщикам.Количество, 1) КАК ЧИСЛО(15, 2)) КАК Цена,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ЗаказыПоставщикам.СуммаUSD, 0) / ЕСТЬNULL(ЗаказыПоставщикам.Количество, 1) КАК ЧИСЛО(15, 2)) КАК ЦенаUSD,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ЗаказыПоставщикам.СуммаEUR, 0) / ЕСТЬNULL(ЗаказыПоставщикам.Количество, 1) КАК ЧИСЛО(15, 2)) КАК ЦенаEUR
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеТМЦСпути.Товары КАК Товары
	|		ПО ЗаказыПоставщикам.Номенклатура = Товары.Номенклатура
	|			И ЗаказыПоставщикам.Регистратор = Товары.Ссылка.ДокОснование
	|ГДЕ
	|	ЗаказыПоставщикам.Регистратор = &Регистратор
	|	И Товары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ_Движения = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТЗ_Движения.Количество() = 0 Тогда
		СообщитьИзМодуля("Нет движений для Сторно!!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	////////// ПОЙДЕМ ПО ТЧ ТОВАРЫ ///////////////////////////////////////////////////////////
	
	Для Каждого СтрокаТЧ ИЗ Товары Цикл
		
		Если СтрокаТЧ.Количество > 0 Тогда
			
			СтруктураПоиска = Новый Структура("Номенклатура, Цена", СтрокаТЧ.Номенклатура, СтрокаТЧ.Цена);
			НайденныеСтроки = ТЗ_Движения.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				СообщитьИзМодуля("Нет движений для Сторно по номенклатуре " + Строка(СтрокаТЧ.Номенклатура) + " и цене " + Строка(СтрокаТЧ.Цена) + " !!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			КоличествоКУбыванию = СтрокаТЧ.Количество;
			
			Для Каждого Стр ИЗ НайденныеСтроки Цикл
				
				Движение = Движения.ЗаказыПоставщикам.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Стр);
				
				Движение.ВидДвижения = ?(Стр.ВидДвижения = ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
				Движение.Период = Дата;
				Движение.Регистратор = Ссылка;
				
				///////////////////////////////////////////////////////////////////////////////////
				
				Если КоличествоКУбыванию < Стр.Количество Тогда
					
					Движение.Количество = КоличествоКУбыванию;
					Движение.СуммаРуб = Стр.Цена * КоличествоКУбыванию;
					Движение.СуммаUSD = Стр.ЦенаUSD * КоличествоКУбыванию;
					Движение.СуммаEUR = Стр.ЦенаEUR * КоличествоКУбыванию;
					Прервать;
					
				КонецЕсли;
				
				КоличествоКУбыванию = КоличествоКУбыванию - Стр.Количество;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСторно(ДокОснование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ДокОснование);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыПоставщикам.Период КАК Период,
	|	ЗаказыПоставщикам.Регистратор КАК Регистратор,
	|	ЗаказыПоставщикам.ВидДвижения КАК ВидДвижения,
	|	ЗаказыПоставщикам.Склад КАК Склад,
	|	ЗаказыПоставщикам.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикам.Заказ КАК Заказ,
	|	ЗаказыПоставщикам.Количество КАК Количество,
	|	ЗаказыПоставщикам.СуммаРуб КАК Всего,
	|	ЗаказыПоставщикам.СуммаUSD КАК СуммаUSD,
	|	ЗаказыПоставщикам.СуммаEUR КАК СуммаEUR,
	|	ЗаказыПоставщикам.Отправитель КАК Отправитель,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ЗаказыПоставщикам.СуммаРуб, 0) / ЕСТЬNULL(ЗаказыПоставщикам.Количество, 1) КАК ЧИСЛО(15, 2)) КАК Цена,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Товары.Цена, 0) КАК ЧИСЛО(15, 2)) КАК ЦенаИзДокумента,
	|	1 КАК Коэффициент
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК Товары
	|		ПО ЗаказыПоставщикам.Номенклатура = Товары.Номенклатура
	|			И ЗаказыПоставщикам.Регистратор = Товары.Ссылка
	|ГДЕ
	|	ЗаказыПоставщикам.Регистратор = &Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
		
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
		
	Товары.Очистить();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
		ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ,ЭтотОбъект);
		РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект,"ОтВсего");
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ЭтотОбъект);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
